Revit 2024 API
EffectInstance Constructor
 Constructs the effect instance for geometry having the specified vertex format.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public EffectInstance(
	VertexFormatBits vertexFormatBits
)
Visual Basic
Public Sub New ( _
	vertexFormatBits As VertexFormatBits _
)
Visual C++
public:
EffectInstance(
	VertexFormatBits vertexFormatBits
)
Parameters
vertexFormatBits
Type: Autodesk.Revit.DB.DirectContext3D.VertexFormatBits
 The vertex format of the geometry to be used with this effect instance.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
Autodesk.Revit.Exceptions.InvalidOperationException |  This EffectInstance is not available because Revit is not currently rendering. In general, this EffectInstance must be used in the scope of the RenderScene() callback of IDirectContext3DServer.
See Also
EffectInstance Class
Autodesk.Revit.DB.DirectContext3D Namespace